org/main/20211021095308-php.org
:PROPERTIES:
:ID:       F7AA266D-F31C-4C0E-B43D-F3132E2F992B
:END:
#+title: PHP
#+HUGO_SECTION:main
I don't know much.
Have something todo with C
* Configuration
~php.ini~ uner ~/etc~ on my Mac
find on other machine using ~phpinfo()~ in php console.
* Library
** intl
I'm finding this library because it's a dependency of Meson, a build system in C. I need it to build pacman.
It's functionality is to "internationalize" the program.

I still don't know how to install it.
*** Log
a way I tried is:
1. update php
2. brew install icu4c
3. sudo pecl install intl
But I failed, it's reporting missing icu packages
