content/main/20211021095308-php.md
+++
title = "PHP"
author = ["System Administrator"]
draft = false
+++

I don't know much.
Have something todo with C


## Configuration {#configuration}

`php.ini` uner `/etc` on my Mac
find on other machine using `phpinfo()` in php console.


## Library {#library}


### intl {#intl}

I'm finding this library because it's a dependency of Meson, a build system in C. I need it to build pacman.
It's functionality is to "internationalize" the program.

I still don't know how to install it.


#### Log {#log}

a way I tried is:

1.  update php
2.  brew install icu4c
3.  sudo pecl install intl

But I failed, it's reporting missing icu packages